{
  "about": "About",
  "projects": "Projects",
  "contact": "Contact",
  "softwareDeveloper": "Software Developer",
  "aboutTitle": "About me",
  "aboutDescription": "I am a programming enthusiast with experience in building modern web applications. I enjoy learning new technologies and developing my skills.",
  "aboutImageAlt": "Programmer photo",
  "trustedMeTitle": "Trusted me",
  "trustedCompanies": [
    {
      "name": "Zirto",
      "logoUrl": "https://cdn-gcmjl.nitrocdn.com/UCYBrQScZZanDqyZZKBSJOJoiOlaNKfK/assets/images/optimized/rev-b23fa68/zirto.pl/wp-content/uploads/2022/05/logo-dark.png",
      "role": "PHP developer",
      "duration": "4 months"
    },
    {
      "name": "IRONteam",
      "logoUrl": "https://ironteam.pl/wp-content/uploads/2024/05/LOGO-KOLOR-18-scaled-1-320x168.png",
      "role": "PHP developer",
      "duration": "8 months"
    },
    {
      "name": "BluSoft",
      "logoUrl": "https://panel.bluserwer.pl/images/blusoft.webp",
      "role": "Junior PHP developer",
      "duration": "1 year and 7 months"
    },
    {
      "name": "Vocale",
      "logoUrl": "https://vocale.app/img/logo_V.80efb8d5.png",
      "role": "Junior flutter developer",
      "duration": "2 years"
    }
  ],
  "workedFor": "I worked there for {{duration}}",
  "workedForCurrent": "currently working here for {{duration}}",
  "aboutSkillsTitle": "Technologies I know",
  "aboutSkills": [
    "JavaScript",
    "React",
    "Node.js",
    "HTML",
    "CSS",
    "Git",
    "PHP",
    "Symfony",
    "Java",
    "Spring Boot",
    "MySQL",
    "jQuery",
    "Tailwind",
    "WordPress",
    "WooCommerce",
    "Flutter",
    "Dart"
  ],
  "experienceSimple": "Over 3 years of commercial experience!",
  "seePortfolioBtn": "See my portfolio",
  "educationTitle": "My education",
  "educationList": [
    "Wyższa Szkoła Gospodarki w Bydgoszczy, Computer Science, 2024-2028",
    "Zespół Szkół Mechanicznych nr 1, IT Technician (programmer), 2019-2024"
  ],
  "projectsTitle": "My projects",
  "seeWebsite": "See project",
  "pageNotFound": "Page not found",
  "backToHome": "Home",
  "back": "Back",
  "seeGithub": "See github",
  "refinanseMainText": "Refinanse is a website created for a law firm based in Bydgoszcz. The site was built using WordPress and the Elementor page builder. The design was faithfully recreated based on a mockup originally created in Figma.",
  "refinanseContact": "The website includes a contact form created using the Forminator plugin. The form is secured with reCAPTCHA v3.",
  "refinanseMobileText": "The website is fully responsive and optimized for mobile devices, tablets, and desktop screens. Its layout adapts seamlessly to any screen size, ensuring a smooth and user-friendly experience across all platforms.",
  "ankietDevMainText": "AnkietDev is a platform that enables you to create online surveys quickly and easily. Users can effortlessly view their survey results, and every created survey can be edited or deleted. Registration is fast, intuitive, and hassle-free.",
  "ankietDevContact": "The platform features a contact page with a form where users can request assistance or propose collaboration with the creator. Users can also submit suggestions for new features that should be added to the platform.",
  "ankietDevRegisterText": "The website offers a simple registration process with only three fields: email, password, and confirm password. No confirmation is required, making the process very fast — users can log in immediately after registering and create their first survey right away.",
  "ankietDevDashboardText": "The dashboard is where users can manage their surveys — delete, edit, or create new ones. They can also preview a selected survey. From here, users can navigate to the statistics page via the menu located on the left-hand side.",
  "ankietDevCreateNewText": "Creating a survey is simple — you can add both open-ended and multiple-choice questions with any number of answer options. Fast, easy, and effective",
  "ankietDevStatisticsText": "The platform allows users to review survey results in a clear percentage format and view open-ended responses. It also provides the number of answers for each question, as well as the total number of responses for the entire survey."
}
