{
  "about": "About",
  "projects": "Projects",
  "contact": "Contact",
  "home": "Home",
  "softwareDeveloper": "Software Developer",
  "aboutTitle": "About me",
  "aboutImageAlt": "Programmer photo",
  "trustedMeTitle": "Trusted me",
  "trustedCompanies": [
    {
      "name": "Zirto",
      "logoUrl": "https://cdn-gcmjl.nitrocdn.com/UCYBrQScZZanDqyZZKBSJOJoiOlaNKfK/assets/images/optimized/rev-b23fa68/zirto.pl/wp-content/uploads/2022/05/logo-dark.png",
      "role": "PHP developer",
      "duration": "4 months"
    },
    {
      "name": "IRONteam",
      "logoUrl": "https://ironteam.pl/wp-content/uploads/2024/05/LOGO-KOLOR-18-scaled-1-320x168.png",
      "role": "PHP developer",
      "duration": "8 months"
    },
    {
      "name": "BluSoft",
      "logoUrl": "https://panel.bluserwer.pl/images/blusoft.webp",
      "role": "Junior PHP developer",
      "duration": "1 year and 7 months"
    },
    {
      "name": "Vocale",
      "logoUrl": "https://vocale.app/img/logo_V.80efb8d5.png",
      "role": "Junior flutter developer",
      "duration": "2 years"
    }
  ],
  "workedFor": "I worked there for {{duration}}",
  "workedForCurrent": "currently working here for {{duration}}",
  "experienceSimple": "Over 3 years of commercial experience!",
  "seePortfolioBtn": "See my portfolio",
  "projectsTitle": "My projects",
  "seeWebsite": "See project",
  "pageNotFound": "Page not found",
  "backToHome": "Home",
  "back": "Back",
  "seeGithub": "See github",
  "ankietDevMainText": "AnkietDev is a platform that enables you to create online surveys quickly and easily. Users can effortlessly view their survey results, and every created survey can be edited or deleted. Registration is fast, intuitive, and hassle-free.",
  "ankietDevContact": "The platform features a contact page with a form where users can request assistance or propose collaboration with the creator. Users can also submit suggestions for new features that should be added to the platform.",
  "ankietDevRegisterText": "The website offers a simple registration process with only three fields: email, password, and confirm password. No confirmation is required, making the process very fast — users can log in immediately after registering and create their first survey right away.",
  "ankietDevDashboardText": "The dashboard is where users can manage their surveys — delete, edit, or create new ones. They can also preview a selected survey. From here, users can navigate to the statistics page via the menu located on the left-hand side.",
  "ankietDevCreateNewText": "Creating a survey is simple — you can add both open-ended and multiple-choice questions with any number of answer options. Fast, easy, and effective",
  "ankietDevStatisticsText": "The platform allows users to review survey results in a clear percentage format and view open-ended responses. It also provides the number of answers for each question, as well as the total number of responses for the entire survey.",
  "homeSubtitle": "I create modern web applications with a passion for clean code and innovative solutions.",
  "footerDescription": "I create modern web applications with a passion for clean code and innovative solutions.",
  "footerNavigation": "Navigation",
  "footerContact": "Contact",
  "footerCopyright": "© 2025 Dawid Czyżewski. All rights reserved.",
  "footerMadeWith": "Made with ❤️ using React & Tailwind CSS",
  "aboutGreeting": "Hi! I'm Dawid",
  "aboutDescription": "I am a programming enthusiast in creating modern web and mobile applications. I specialize in PHP, JavaScript, React and Flutter, but I like to experiment with different technologies.",
  "aboutExperience": "Almost 4 years of commercial experience",
  "aboutContactMe": "Contact me",
  "aboutSkills": "Skills",
  "aboutExperienceTitle": "Experience",
  "aboutEducationTitle": "Education",
  "experienceZirto": {
    "title": "PHP Developer",
    "period": "6 months - Currently",
    "company": "Zirto",
    "description": "Development of web applications in PHP"
  },
  "experienceIRONteam": {
    "title": "PHP Developer",
    "period": "8 months",
    "company": "IRONteam",
    "description": "Development of medical applications in PHP"
  },
  "experienceBluSoft": {
    "title": "Junior PHP Developer",
    "period": "1 year and 7 months",
    "company": "BluSoft",
    "description": "Development of web and mobile applications"
  },
  "experienceVocale": {
    "title": "Junior Flutter Developer",
    "period": "2 years",
    "company": "Vocale",
    "description": "Development of mobile applications in Flutter"
  },
  "educationWSG": {
    "degree": "Computer Science",
    "period": "2024 - 2028",
    "school": "Wyższa Szkoła Gospodarki w Bydgoszczy",
    "description": "Higher education in computer science"
  },
  "educationZSM": {
    "degree": "IT Technician (programmer)",
    "period": "2019 - 2024",
    "school": "Zespół Szkół Mechanicznych nr 1",
    "description": "Technical school in IT"
  },
  "contactEmail": "Email",
  "contactLocation": "Location",
  "contactLocationValue": "Bydgoszcz / Remote",
  "contactFindMe": "Find me on:",
  "projectsDescription": "Here are all the projects from my current portfolio. Each of them represents my skills and passion for creating modern solutions.",
  "projectsView": "View",
  "projectsComingSoon": "More projects coming soon!",
  "projectsComingSoonDescription": "I'm working on new projects that will be available soon. Follow my social media to stay updated.",
  "projectsContactMe": "Contact me",
  "ankietDevTitle": "Survey creation platform",
  "ankietDevDescription": "AnkietDev is a modern web platform for creating, managing and analyzing surveys. Built in PHP using React and Tailwind CSS.",
  "ankietDevMainTitle": "Main page",
  "ankietDevContactTitle": "Contact",
  "ankietDevRegisterTitle": "Registration",
  "ankietDevDashboardTitle": "User panel",
  "ankietDevCreateNewTitle": "Creating survey",
  "ankietDevStatisticsTitle": "Statistics",
  "neoCasinoMainTitle": "Main page",
  "neoCasinoDescription": "NeoCasino is a browser game simulating an online casino, created using React. The game offers a variety of games, providing users with entertainment and the excitement of a casino without the risk of losing real money.",
  "neoCasinoTitle": "NeoCasino - Browser Game",
  "neoCasinoMainText": "NeoCasino is a browser game that simulates gambling games such as roulette, blackjack, and slots. The game was created using the React library, ensuring smooth performance and an attractive user interface. NeoCasino offers a variety of games that provide users with entertainment and the excitement of a casino without the risk of losing real money.",
  "neoCasinoSlotTitle": "Slot Machine",
  "neoCasinoSlotText": "The slot machine is one of the games available in NeoCasino. It is a classic 3x3 slot game with various symbols. The game offers simple and enjoyable gameplay, perfect for fans of casino slots.",
  "neoCasinoLegendTitle": "Game Legend",
  "neoCasinoLegendText": "The game legend is a section in NeoCasino that explains the rules and mechanics of the games available on the platform. It is useful for players who have not previously encountered such games.",
  "neoCasinoBlackJackTitle": "Blackjack",
  "neoCasinoBlackJackText": "Blackjack is a popular card game available in NeoCasino. The objective of the game is to get a hand value as close to 21 as possible without exceeding it, while also having a higher value than the dealer's hand.",
  "neoCasinoRouletteTitle": "Roulette",
  "neoCasinoRouletteText": "Roulette is a classic casino game available at NeoCasino. This version of roulette is designed in the style of case openings from Counter-Strike 2, giving it a unique atmosphere and dynamic feel. Players can place various bets and enjoy an exciting gameplay experience full of tension and random thrills.",
  "neoCasinoCrashTitle": "Crash",
  "neoCasinoCrashText": "Crash is a casino game available in NeoCasino. The game offers exciting gameplay and requires strategic thinking. A random multiplier increases over time until the game ends. If the user fails to cash out before the crash occurs, they lose.",
  "neoCasinoScratchCardTitle": "Scratch Card",
  "neoCasinoScratchCardText": "Scratch Card is a casino game available in NeoCasino. The game offers simple and enjoyable gameplay, perfect for fans of casino scratch cards. Players must decide how many cards they want to bet on, then scratch them to reveal the symbols and check if they won. The game provides excitement and adrenaline associated with discovering the results.",
  "devLinkTitle": "DevLink - Platform for finding people to work on projects together and share knowledge",
  "devLinkDescription": "DevLink is a modern web platform for finding people to work on projects together and share knowledge. Built in PHP using React and Tailwind CSS.",
  "devLinkMainTitle": "Main page",
  "devLinkMainText": "DevLink is a social platform created specifically for developers and creators. It enables finding people to work on projects together, sharing knowledge and experience. The platform offers an intuitive interface that allows users to easily connect and start collaborating on innovative projects.",
  "devLinkLoginAndRegisterTitle": "Login and registration",
  "devLinkLoginAndRegisterText": "DevLink offers an extremely fast and easy registration. Account requires email confirmation, which ensures platform security. Using a nickname guarantees full user anonymity, allowing users to freely share knowledge and collaborate on projects without privacy concerns. The login system is intuitive and secure, utilizing modern authentication methods. After logging in, users have immediate access to all platform features.",
  "devLinkContactTitle": "Contact",
  "devLinkContactText": "DevLink has a contact page with a form where you can request help or propose collaboration with the creator. Users can also submit suggestions for features that should be added to the platform. The contact form allows for quick and direct communication with the DevLink team. All inquiries are thoroughly reviewed, and responses are provided within a few business days.",
  "devLinkTermsOfServiceTitle": "Terms of Service",
  "devLinkTermsOfServiceText": "Terms of Service is a document that defines the rules and conditions for using the platform. It contains information about user rights and obligations, as well as principles of confidentiality and personal data protection. The terms are transparent and written in simple language so that every user can easily understand their rights and obligations. The document also includes information on conflict resolution procedures and data protection protocols.",
  "devLinkProfileTitle": "Profile",
  "devLinkProfileText": "Profile is a place where users can manage their profile and announcements. They can add information about their skills, experience, and technologies they work with. From the profile, users can also manage chats and view their collaboration history with other users.",
  "aboutCertificatesTitle": "Certificates",
  "aboutLanguagesTitle": "Languages",
  "downloadCertificate": "Download certificate",
  "certificate1": {
    "name": "EnglishScore certificate",
    "issuer": "EnglishScore",
    "date": "2025",
    "description": "Certificate confirming English language skills"
  },
  "certificate2": {
    "name": "Revas - Business Simulation Games Certificate",
    "issuer": "Revas - Business Simulation Games",
    "date": "2025",
    "description": "Certificate confirming skills in running a computer company"
  },
  "languagePolish": {
    "name": "Polish",
    "level": "Native"
  },
  "languageEnglish": {
    "name": "English",
    "level": "B2/C1"
  },
  "languageJapanese": {
    "name": "Japanese",
    "level": "N5"
  }
}
