{
  "about": "O mnie",
  "projects": "Projekty",
  "contact": "Kontakt",
  "aboutTitle": "O mnie",
  "home": "Strona główna",
  "softwareDeveloper": "Programista",
  "aboutDescription": "Jestem pasjonatem programowania z doświadczeniem w tworzeniu nowoczesnych aplikacji webowych. Lubię uczyć się nowych technologii i rozwijać swoje umiejętności.",
  "aboutImageAlt": "Zdjęcie programisty",
  "trustedMeTitle": "Zaufali mi",
  "trustedCompanies": [
    {
      "name": "Zirto",
      "logoUrl": "https://cdn-gcmjl.nitrocdn.com/UCYBrQScZZanDqyZZKBSJOJoiOlaNKfK/assets/images/optimized/rev-b23fa68/zirto.pl/wp-content/uploads/2022/05/logo-dark.png",
      "role": "PHP developer",
      "duration": "4 miesięcy"
    },
    {
      "name": "IRONteam",
      "logoUrl": "https://ironteam.pl/wp-content/uploads/2024/05/LOGO-KOLOR-18-scaled-1-320x168.png",
      "role": "PHP developer",
      "duration": "8 miesięcy"
    },
    {
      "name": "BluSoft",
      "logoUrl": "https://panel.bluserwer.pl/images/blusoft.webp",
      "role": "Junior PHP developer",
      "duration": "1 rok i 7 miesięcy"
    },
    {
      "name": "Vocale",
      "logoUrl": "https://vocale.app/img/logo_V.80efb8d5.png",
      "role": "Junior flutter developer",
      "duration": "2 lata"
    }
  ],
  "workedFor": "pracowałem tam przez: {{duration}}",
  "workedForCurrent": "aktualnie pracuję tutaj od {{duration}}",
  "aboutSkillsTitle": "Technologie które znam",
  "aboutSkills": [
    "JavaScript",
    "React",
    "Node.js",
    "HTML",
    "CSS",
    "Git",
    "PHP",
    "Symfony",
    "Java",
    "Spring Boot",
    "MySQL",
    "jQuery",
    "Tailwind",
    "WordPress",
    "WooCommerce",
    "Flutter",
    "Dart"
  ],
  "experienceSimple": "Łącznie ponad {{years}} lata doświadczenia komercyjnego!",
  "seePortfolioBtn": "Zobacz moje portfolio",
  "educationTitle": "Moje wykształcenie",
  "educationList": [
    "Wyższa Szkoła Gospodarki w Bydgoszczy, Informatyka, 2024-2028",
    "Zespół Szkół Mechanicznych nr 1, Technik programista, 2019-2024"
  ],
  "projectsTitle": "Moje projekty",
  "back": "Powrót",
  "seeGithub": "Zobacz github",
  "pageNotFound": "Strona nie znaleziona",
  "backToHome": "Strona główna",
  "seeWebsite": "Zobacz projekt",
  "refinanseMainText": "Refinanse to strona internetowa stworzona dla bydgoskiej kancelari prawnej. Serwis został wykonany w WordPressie z wykorzystaniem kreatora Elementor. Projekt graficzny został wiernie odwzorowany na podstawie makiety przygotowanej w Figma.",
  "refinanseContact": "Strona zawiera formularz kontaktowy stworzony za pomocą wtyczki Forminator. Formularz został zabezpieczony przy użyciu reCAPTCHA v3.",
  "refinanseMobileText": "Strona została w pełni dostosowana do urządzeń mobilnych, tabletów oraz komputerów stacjonarnych. Dzięki responsywnemu projektowi, zawartość automatycznie dopasowuje się do rozmiaru ekranu, zapewniając wygodne i intuicyjne korzystanie na każdym urządzeniu.",
  "ankietDevMainText": "AnkietDev to platforma, która umożliwia tworzenie ankiet online w prosty i szybki sposób. Użytkownicy mogą w łatwy sposób sprawdzać wyniki swoich ankiet, a każdą utworzoną ankietę można edytować lub usunąć. Rejestracja jest szybka, intuicyjna i bezproblemowa.",
  "ankietDevContact": "Platforma posiada podstronę kontaktową z formularzem, w której można zgłosić prośbę o pomoc lub nawiązać współpracę z twórcą. Użytkownicy mogą również przekazać sugestie dotyczące funkcji, które powinny zostać dodane do platformy.",
  "ankietDevRegisterText": "Strona oferuje prostą rejestrację składającą się jedynie z trzech pól: e-mail, hasło oraz powtórzenie hasła. Nie jest wymagane potwierdzenie rejestracji, dzięki czemu proces jest bardzo szybki, a użytkownik może od razu po rejestracji zalogować się i utworzyć swoją pierwszą ankietę.",
  "ankietDevDashboardText": "Dashboard to miejsce, w którym użytkownik może zarządzać swoimi ankietami — usuwać je, edytować lub tworzyć nowe. Istnieje również możliwość podglądu wybranej ankiety. Z tego poziomu można przejść do podstrony ze statystykami, korzystając z nawigacji umieszczonej po lewej stronie.",
  "ankietDevCreateNewText": "Tworzenie ankiety jest proste — można dodawać pytania otwarte oraz zamknięte z dowolną liczbą opcji odpowiedzi. Szybko, łatwo i skutecznie.",
  "ankietDevStatisticsText": "Platforma umożliwia przeglądanie wyników ankiet w czytelnej formie procentowej oraz podgląd odpowiedzi otwartych. Użytkownik może sprawdzić liczbę odpowiedzi dla każdego pytania, a także łączną liczbę udzielonych odpowiedzi w całej ankiecie."
}
