{
  "about": "O mnie",
  "projects": "Projekty",
  "contact": "Kontakt",
  "aboutTitle": "O mnie",
  "home": "Strona główna",
  "softwareDeveloper": "Programista",
  "aboutImageAlt": "Zdjęcie programisty",
  "trustedMeTitle": "Zaufali mi",
  "trustedCompanies": [
    {
      "name": "Zirto",
      "logoUrl": "https://cdn-gcmjl.nitrocdn.com/UCYBrQScZZanDqyZZKBSJOJoiOlaNKfK/assets/images/optimized/rev-b23fa68/zirto.pl/wp-content/uploads/2022/05/logo-dark.png",
      "role": "PHP developer",
      "duration": "4 miesięcy"
    },
    {
      "name": "IRONteam",
      "logoUrl": "https://ironteam.pl/wp-content/uploads/2024/05/LOGO-KOLOR-18-scaled-1-320x168.png",
      "role": "PHP developer",
      "duration": "8 miesięcy"
    },
    {
      "name": "BluSoft",
      "logoUrl": "https://panel.bluserwer.pl/images/blusoft.webp",
      "role": "Junior PHP developer",
      "duration": "1 rok i 7 miesięcy"
    },
    {
      "name": "Vocale",
      "logoUrl": "https://vocale.app/img/logo_V.80efb8d5.png",
      "role": "Junior flutter developer",
      "duration": "2 lata"
    }
  ],
  "workedFor": "pracowałem tam przez: {{duration}}",
  "workedForCurrent": "aktualnie pracuję tutaj od {{duration}}",
  "experienceSimple": "Łącznie ponad {{years}} lata doświadczenia komercyjnego!",
  "seePortfolioBtn": "Zobacz moje portfolio",
  "projectsTitle": "Moje projekty",
  "back": "Powrót",
  "seeGithub": "Zobacz github",
  "pageNotFound": "Strona nie znaleziona",
  "backToHome": "Strona główna",
  "seeWebsite": "Zobacz projekt",
  "ankietDevMainText": "AnkietDev to platforma, która umożliwia tworzenie ankiet online w prosty i szybki sposób. Użytkownicy mogą w łatwy sposób sprawdzać wyniki swoich ankiet, a każdą utworzoną ankietę można edytować lub usunąć. Rejestracja jest szybka, intuicyjna i bezproblemowa.",
  "ankietDevContact": "Platforma posiada podstronę kontaktową z formularzem, w której można zgłosić prośbę o pomoc lub nawiązać współpracę z twórcą. Użytkownicy mogą również przekazać sugestie dotyczące funkcji, które powinny zostać dodane do platformy.",
  "ankietDevRegisterText": "Strona oferuje prostą rejestrację składającą się jedynie z trzech pól: e-mail, hasło oraz powtórzenie hasła. Nie jest wymagane potwierdzenie rejestracji, dzięki czemu proces jest bardzo szybki, a użytkownik może od razu po rejestracji zalogować się i utworzyć swoją pierwszą ankietę.",
  "ankietDevDashboardText": "Dashboard to miejsce, w którym użytkownik może zarządzać swoimi ankietami — usuwać je, edytować lub tworzyć nowe. Istnieje również możliwość podglądu wybranej ankiety. Z tego poziomu można przejść do podstrony ze statystykami, korzystając z nawigacji umieszczonej po lewej stronie.",
  "ankietDevCreateNewText": "Tworzenie ankiety jest proste — można dodawać pytania otwarte oraz zamknięte z dowolną liczbą opcji odpowiedzi. Szybko, łatwo i skutecznie.",
  "ankietDevStatisticsText": "Platforma umożliwia przeglądanie wyników ankiet w czytelnej formie procentowej oraz podgląd odpowiedzi otwartych. Użytkownik może sprawdzić liczbę odpowiedzi dla każdego pytania, a także łączną liczbę udzielonych odpowiedzi w całej ankiecie.",
  "homeSubtitle": "Tworzę nowoczesne aplikacje webowe z pasją do czystego kodu i innowacyjnych rozwiązań.",
  "footerDescription": "Tworzę nowoczesne aplikacje webowe z pasją do czystego kodu i innowacyjnych rozwiązań.",
  "footerNavigation": "Nawigacja",
  "footerContact": "Kontakt",
  "footerCopyright": "© {{year}} Dawid Czyżewski. Wszystkie prawa zastrzeżone.",
  "footerMadeWith": "Stworzone z ❤️ używając React & Tailwind CSS",
  "aboutGreeting": "Cześć! Jestem Dawid",
  "aboutDescription": "Jestem pasjonatem programowania w tworzeniu nowoczesnych aplikacji webowych i mobilnych. Specjalizuję się w PHP, JavaScript, React i Flutter, ale lubię eksperymentować z różnymi technologiami.",
  "aboutExperience": "Prawie 4 lata doświadczenia komercyjnego",
  "aboutContactMe": "Skontaktuj się ze mną",
  "aboutSkills": "Umiejętności",
  "aboutExperienceTitle": "Doświadczenie",
  "aboutEducationTitle": "Wykształcenie",
  "experienceZirto": {
    "title": "PHP Developer",
    "period": "6 miesięcy - Obecnie",
    "company": "Zirto",
    "description": "Rozwój aplikacji webowych w PHP"
  },
  "experienceIRONteam": {
    "title": "PHP Developer",
    "period": "8 miesięcy",
    "company": "IRONteam",
    "description": "Rozwój aplikacji medycznych w PHP"
  },
  "experienceBluSoft": {
    "title": "Junior PHP Developer",
    "period": "1 rok i 7 miesięcy",
    "company": "BluSoft",
    "description": "Rozwój aplikacji webowych i mobilnych"
  },
  "experienceVocale": {
    "title": "Junior Flutter Developer",
    "period": "2 lata",
    "company": "Vocale",
    "description": "Rozwój aplikacji mobilnych w Flutter"
  },
  "educationWSG": {
    "degree": "Informatyka",
    "period": "2024 - 2028",
    "school": "Wyższa Szkoła Gospodarki w Bydgoszczy",
    "description": "Studia wyższe w zakresie informatyki"
  },
  "educationZSM": {
    "degree": "Technik programista",
    "period": "2019 - 2024",
    "school": "Zespół Szkół Mechanicznych nr 1",
    "description": "Technikum informatyczne"
  },
  "contactEmail": "Email",
  "contactLocation": "Lokalizacja",
  "contactLocationValue": "Bydgoszcz / Zdalnie",
  "contactFindMe": "Znajdź mnie na:",
  "projectsDescription": "Oto wszystkie projekty z mojego aktualnego portfolio. Każdy z nich reprezentuje moje umiejętności i pasję do tworzenia nowoczesnych rozwiązań.",
  "projectsView": "Zobacz",
  "projectsComingSoon": "Więcej projektów już wkrótce!",
  "projectsComingSoonDescription": "Pracuję nad kolejnymi projektami, które wkrótce będą dostępne. Śledź moje social media, aby być na bieżąco.",
  "projectsContactMe": "Skontaktuj się ze mną",
  "ankietDevTitle": "Platforma do tworzenia ankiet",
  "ankietDevDescription": "AnkietDev to nowoczesna platforma webowa umożliwiająca tworzenie, zarządzanie i analizę ankiet. Zbudowana w PHP z wykorzystaniem React i Tailwind CSS.",
  "ankietDevMainTitle": "Strona główna",
  "ankietDevContactTitle": "Kontakt",
  "ankietDevRegisterTitle": "Rejestracja",
  "ankietDevDashboardTitle": "Panel użytkownika",
  "ankietDevCreateNewTitle": "Tworzenie ankiety",
  "ankietDevStatisticsTitle": "Statystyki",
  "neoCasinoMainTitle": "Strona główna",
  "neoCasinoDescription": "NeoCasino to gra przeglądarkowa symulująca kasyno online, stworzona przy użyciu React. Gra oferuje różnorodne gry, zapewniając użytkownikom rozrywkę i emocje związane z kasynem bez ryzyka utraty prawdziwych pieniędzy.",
  "neoCasinoTitle": "NeoCasino - Gra przeglądarkowa",
  "neoCasinoMainText": "NeoCasino to gra przeglądarkowa, która symuluje gry hazardowe takie jak ruletka, blackjack czy sloty. Gra została stworzona z wykorzystaniem biblioteki React, co zapewnia płynne działanie i atrakcyjny interfejs użytkownika. NeoCasino oferuje różnorodne gry, które dostarczają użytkownikom rozrywki i emocji związanych z kasynem, bez ryzyka utraty prawdziwych pieniędzy.",
  "neoCasinoSlotTitle": "Maszynowa slotowa",
  "neoCasinoSlotText": "Maszynowa slotowa to jedna z gier dostępnych w NeoCasino. Jest to klasyczna gra automatyowa 3x3 z różnymi symbolami. Gra oferuje prostą i przyjemną rozgrywkę, idealną dla miłośników kasynowych slotów.",
  "neoCasinoLegendTitle": "Legenda gry",
  "neoCasinoLegendText": "Legenda gry to sekcja w NeoCasino, która wyjaśnia zasady i mechanikę gier dostępnych na platformie. Przydatne dla graczy, którzy nie mieli wcześniej styczności z takimi grami.",
  "neoCasinoBlackJackTitle": "Blackjack",
  "neoCasinoBlackJackText": "Blackjack to popularna gra karciana dostępna w NeoCasino. Celem gry jest uzyskanie sumy punktów jak najbliższej 21, bez jej przekraczania. Gra oferuje emocjonującą rozgrywkę i wymaga strategicznego myślenia.",
  "neoCasinoRouletteTitle": "Ruletka",
  "neoCasinoRouletteText": "Ruletka to klasyczna gra kasynowa dostępna w NeoCasino. Wersja ruletki w tym serwisie została zaprojektowana w stylu otwierania skrzynek znanym z gry Counter-Strike 2, co nadaje jej wyjątkowy klimat i dynamikę. Gracze mogą obstawiać różne zakłady i cieszyć się emocjonującą rozgrywką pełną napięcia i losowych emocji.",
  "neoCasinoCrashTitle": "Crash",
  "neoCasinoCrashText": "Crash to gra kasynowa dostępna w NeoCasino. Gra oferuje emocjonującą rozgrywkę i wymaga strategicznego myślenia. Mnożnik losowy rośnie wraz z czasem, aż do momentu, w którym gra się kończy. Jeżeli użytkownik nie zdąży wypłacić zanim nastąpi crash, to przegrywa.",
  "neoCasinoScratchCardTitle": "Zdrapka",
  "neoCasinoScratchCardText": "Zdrapka to gra kasynowa dostępna w NeoCasino. Gra oferuje prostą i przyjemną rozgrywkę, idealną dla miłośników kasynowych zdrapek. Gracz musi zdecydować, na ile zdrapek chce postawić, a następnie zdrapać je, aby odkryć symbole i sprawdzić, czy wygrał. Gra dostarcza emocji i adrenaliny związanej z odkrywaniem wyników.",
  "devLinkTitle": "DevLink - Platforma do znajdowania osób do wspólnego robienia projektów i dzielenia się wiedzą",
  "devLinkDescription": "DevLink to nowoczesna platforma webowa umożliwająca znajdowanie osób do wspólnego robienia projektów i dzielenia się wiedzą. Zbudowana w PHP z wykorzystaniem React i Tailwind CSS.",
  "devLinkMainTitle": "Strona główna",
  "devLinkMainText": "DevLink to platforma społecznościowa stworzona specjalnie dla programistów i twórców. Umożliwia znajdowanie osób do wspólnego robienia projektów, dzielenia się wiedzą i doświadczeniem. Platforma oferuje intuicyjny interfejs, który pozwala użytkownikom łatwo nawiązywać kontakty i rozpoczynać współpracę nad innowacyjnymi projektami.",
  "devLinkLoginAndRegisterTitle": "Logowanie i rejestracja",
  "devLinkLoginAndRegisterText": "DevLink oferuje niezwykle szybką i łatwą rejestrację. Konto wymaga potwierdzenia poprzez e-mail, co zapewnia bezpieczeństwo platformy. Używanie nicku gwarantuje pełną anonimowość użytkowników, dzięki czemu można swobodnie dzielić się wiedzą i współpracować nad projektami bez obaw o prywatność. System logowania jest intuicyjny i bezpieczny, wykorzystując nowoczesne metody autentykacji. Po zalogowaniu użytkownicy mają natychmiastowy dostęp do wszystkich funkcji platformy.",
  "devLinkContactTitle": "Kontakt",
  "devLinkContactText": "DevLink posiada podstronę kontaktową z formularzem, w której można zgłosić prośbę o pomoc lub nawiązać współpracę z twórcą. Użytkownicy mogą również przekazać sugestie dotyczące funkcji, które powinny zostać dodane do platformy. Formularz kontaktowy umożliwia szybkie i bezpośrednie skontaktowanie się z zespołem DevLink. Wszystkie zgłoszenia są rzetelnie rozpatrywane, a odpowiedzi udzielane w przeciągu kilku dni roboczych.",
  "devLinkTermsOfServiceTitle": "Regulamin",
  "devLinkTermsOfServiceText": "Regulamin to dokument, który określa zasady i warunki korzystania z platformy. Zawiera informacje o prawach i obowiązkach użytkowników, a także o zasadach zachowania poufności i ochrony danych osobowych. Regulamin jest przejrzysty i napisany prostym językiem, aby każdy użytkownik mógł łatwo zrozumieć swoje prawa i obowiązki. Dokument zawiera również informacje o sposobie rozwiązywania konfliktów oraz procedurach dotyczących ochrony danych.",
  "devLinkProfileTitle": "Profil",
  "devLinkProfileText": "Profil to miejsce, w którym użytkownik może zarządzać swoim profilem oraz ogłoszeniami. Może dodać informacje o swoich umiejętnościach, doświadczeniu i technologiach, z którymi pracuje. Z poziomu profilu można również zarządzać czatami oraz przeglądać historię współpracy z innymi użytkownikami.",
  "aboutCertificatesTitle": "Certyfikaty",
  "aboutLanguagesTitle": "Języki",
  "downloadCertificate": "Pobierz certyfikat",
  "certificate1": {
    "name": "EnglishScore certificate",
    "issuer": "EnglishScore",
    "date": "2025",
    "description": "Certyfikat potwierdzający umiejętności w języku angielskim"
  },
  "certificate2": {
    "name": "Revas - Business Simulation Games Certificate",
    "issuer": "Revas - Business Simulation Games",
    "date": "2025",
    "description": "Certyfikat potwierdzający umiejętności w prowadzeniu firmy informatycznej"
  },
  "languagePolish": {
    "name": "Polski",
    "level": "Ojczysty"
  },
  "languageEnglish": {
    "name": "Angielski",
    "level": "B2/C1"
  },
  "languageJapanese": {
    "name": "Japoński",
    "level": "N5"
  }
}
